[
  {
    "id": "research-scientist",
    "title": "Research Scientist",
    "description": "Research Scientist\n\nWe look for research scientists with a proven record of research accomplishments in robotics, machine learning, computer vision, and other related fields. If you enjoy building systems and bring a solid foundation in engineering, you’ll thrive in this role. That said, we’re not just looking for the conventional path — we’re excited about people who can make an impact, no matter their background.\n\nPersonal website or GitHub\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nWhy do you want to work at π?\n\nDescribe your research interests\n\nDescribe your most significant accomplishment or research result\n\nPlease provide names and email addresses for one or two references that we could contact\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "86fe5134739f3b6fc8423de93fa98db809429f020be5c4accd95a45ee50a3ebd"
  },
  {
    "id": "electrical-engineer",
    "title": "Electrical Engineer",
    "description": "Electrical Engineer\n\nWe’re looking for a hands-on engineering leader to drive the strategy, architecture, and execution of our electrical systems. In this role, you’ll own the end-to-end design and development of PCBAs — from early concept and architecture through schematic design, layout, bring-up, validation, and mass production. You’ll maintain precise validation and test processes, and ensure our systems meet the highest standards for reliability and compliance.\n\nBeyond technical impact, you’ll set the direction for our electrical systems strategy, and foster a culture of collaboration, transparency, and first-principles problem solving.\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nWhy do you want to work at π?\n\nTell us about a project you worked on that you’re especially proud of and enjoyed.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "ca5fe2ce0bdfd770723c940a944d64fde2f6b5212ef48e66885a56ba7e405e4e"
  },
  {
    "id": "evaluation-engineer",
    "title": "Evaluation Engineer",
    "description": "Evaluation Engineer\n\nWe’re looking for a product-minded full-stack engineer to build the next generation of our evaluation infrastructure. This role sits at the intersection of research, operations, and engineering, and is responsible for turning evaluation workflows into a robust, scalable internal product. You’ll work closely with researchers and operators to understand how evaluations are requested, scheduled, run, scored, and analyzed today, then design and build a system that dramatically reduces friction, errors, and overhead while increasing reliability and insight.\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "32eca2efb99a4effa6bd61c299430b20d0083b2a1683d31081c4216b87281878"
  },
  {
    "id": "machine-learning-engineer",
    "title": "Machine Learning Engineer",
    "description": "Machine Learning Engineer\n\nWe are looking for engineers with expertise in machine learning systems, data pipelines, and large-scale training infrastructure. Successful candidates will have a proven record of accomplishment in building machine learning systems, working with large models in computer vision, language, or other areas, and an excellent understanding of machine learning infrastructure and systems fundamentals.\n\nThis is a very broad role that can be more focused on your specific area of expertise (e.g. data pipelines or large-scale training). You’ll be faced with challenges that other large-scale AI companies haven’t encountered. For example, unlike most foundation model companies, we don’t acquire our datasets through scraping the open internet, since the dataset we need to train our models largely doesn't exist. We generate petabytes of time-series data in-office and at offsite deployment locations, which then needs to be compressed, uploaded, processed, visualized and loaded onto gigantic training pipelines as efficiently as possible. If you’re up to the challenge, we’d love to hear from you!\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nWe're only hiring in SF at the moment. Please confirm you're willing/able to report to an office in SF for an onsite role?\n\nYes\n\nNo\n\nPlease detail the experience you have with ETL, cloud platforms, ML and ML systems, data pipelines, and large-scale training infrastructure.\n\nWhat is your super power (i.e. the unique value you’d bring to π)?\n\nWhen would you be able to start a new role?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "212568598ba1b6d9c38e7678ec25d65441d06f6acc450272d6c3e2dc7ec7c794"
  },
  {
    "id": "mechanical-design-engineer",
    "title": "Mechanical Design Engineer",
    "description": "Mechanical Design Engineer\n\nWe're looking for an experienced mechanical design engineer to drive the integration and development of our robotic systems, leading innovative designs from concept to deployment. You'll own the full spectrum of mechanical development—from actuator sizing or design to kinematics and work with teams to prototype and ultimately produce systems at scale—ensuring reliability, deployability, and performance. The ideal candidate is a hands-on innovator with deep expertise in mechatronic systems, combining theoretical knowledge with practical engineering skills. Experience with actuation systems, electromechanical integration, machine design, and a track record of bringing mechanical systems to life is essential. If this sounds like you, please apply!\n\nWebsite URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nWhy do you want to work at π?\n\nTell us about a project you worked on that you’re especially proud of and enjoyed.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "da24a903896258cf362660e47dc9572211c3c2b791a80290f35fcf9d015f5987"
  },
  {
    "id": "research-engineer",
    "title": "Research Engineer",
    "description": "Research Engineer\n\nWe're looking for engineers who thrive in the ambiguity of research. In this role, you'll work shoulder to shoulder with researchers and engineers to build the most advanced AI systems to control robots in the real world. If you can implement complex research ideas in a clean, maintainable way, you'll succeed in this role. As a machine learning or robotics generalist with strong communication skills and a passion for solving the problem of physical intelligence, you’ll have the opportunity to make a real impact.\n\nName\n\nEmail\n\nResume/LinkedIn\n\nUpload File\n\nWhy do you want to work at π?\n\nWhat are some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "1468cbdf404d3ce5e42918466e4290b4d94e79251fb484a8659e172889a96f3b"
  },
  {
    "id": "robotics-systems-engineer",
    "title": "Robotics Systems Engineer",
    "description": "Robotics Systems Engineer\n\nWe’re looking for software engineers that thrive on building the infrastructure that makes robotic systems reliable, observable, and scalable. You’ll design and maintain systems that maximize robot uptime, automate deployment, and accelerate data collection and evaluation pipelines. Strong skills in diagnostics, observability, and debugging complex distributed systems will be key, along with a mindset for creating resilient frameworks that adapt to diverse hardware platforms. The work you do here won’t just stay in the lab — it will shape how robots around the world learn and interact with their environments.\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nGitHub or Website URL\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "e4619f035cbb8840a0c69f982f083862f52c53de6fb6110dabd7b15af2e95929"
  },
  {
    "id": "runtime-generalist-engineer",
    "title": "Runtime Generalist Engineer",
    "description": "Runtime Generalist Engineer\n\nAchieving real-world performance requires extremely tight system latency, reliable sensor pipelines, and end-to-end engineering that makes perception and control loops work at real-time speeds.\n\nAs a Runtime Software Engineer, you’ll engineer the low-latency, high-throughput systems that underpin our physical intelligence model. You won’t be designing ML models - you’ll be the person who makes them run flawlessly in production, optimizing every layer from OS to camera pipeline to networking. You’ll collaborate closely with researchers, platform engineers, and robotics operators to identify bottlenecks and extract maximum performance from the entire system.\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "0b64cb4e90f20b48b14a356bd15a463e9194d084ec5dc617881072b3a2076313"
  },
  {
    "id": "software-engineer",
    "title": "Software Engineer",
    "description": "Software Engineer\n\nWe’re looking for exceptional software engineers. You’re the kind of person who starts projects from scratch and works relentlessly to see them through. In this role, you’ll be responsible for the software that humans and robots interact with at π — everything from scaling demonstration collection, to measuring and driving quality, to tightening the loop between data collection and model evaluation. If you have strong engineering skills and are excited to collaborate closely with both operations and research, we’d love to hear from you.\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nWhy do you want to work at π?\n\nWhat are some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "33c9ba4496b75420d0911ce9e3bd7a1416a7a04d2aaf0562bceb658259c92420"
  },
  {
    "id": "head-of-creative",
    "title": "Head of Creative",
    "description": "Head of Creative\n\nWe’re looking for a Head of Creative to shape how the world sees and experiences Physical Intelligence. We’ve been focused on the technical breakthroughs, but now, we need someone to tell our story, beyond the lab. You’ll help define the values, voice, and creative direction that guide everything we put into the world, and work hands-on to communicate that internally and externally. From our website to launching videos, from the way we explain our work to how we celebrate releases and show pride in our team, your influence will be felt across every touchpoint.\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nWhy do you want to work at  π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "231e5d7605cef13ca7ecbf88fb814532f3568a5ce084cdb59f6d6a241d8b3e68"
  },
  {
    "id": "business-operations",
    "title": "Business Operations",
    "description": "Business Operations\n\nWho We Are\n\nPhysical Intelligence is bringing general-purpose AI into the physical world. We are a group of engineers, scientists, roboticists, and company builders developing foundation models and learning algorithms to power the robots of today and the physically-actuated devices of the future.\n\nAs the company scales, success increasingly depends not just on research excellence, but on strong business execution - across partnerships, operations, infrastructure, and deployment.\n\nSuccess in this role looks like independently identifying the highest-leverage problems, structuring them into executable plans, and driving them to measurable outcomes with minimal founder involvement.\n\nThe Team\n\nThis role sits close to the founders and works cross-functionally with research, engineering, operations, finance, legal, and external partners. There is no single “lane”, the mandate is to add leverage wherever the company most needs it.\n\nIn This Role You Will\n\n- Own and execute cross-functional projects with high ambiguity and real business impact.\n\n- Drive data, compute, and infrastructure partnerships, from sourcing through negotiation and management.\n\n- Plug into deployment efforts: sourcing opportunities, structuring contracts, pricing, and operational setup.\n\n- Assist with and drive internal scaling initiatives such as office expansion, international operations, and company planning.\n\n- Support investor, board, and external communications including decks, analyses, and prep.\n\n- Act as an execution arm for founders and leaders, translating priorities into outcomes.\n\nWhat We Hope You’ll Bring\n\n- Strong analytical and strategic instincts with a bias toward action.\n\n- Comfort operating independently in ambiguous environments.\n\n- Commercial mindset and basic financial fluency (contracts, pricing, tradeoffs).\n\n- Exceptional written and verbal communication.\n\n- Willingness to do anything, paired with strong prioritization instincts and comfort pushing back when work is low-leverage.\n\n- Strong π-fit: respect for research and engineering culture, curiosity, and intellectual humility.\n\nBonus Points If You Have\n\n- Background in consulting, venture capital, private equity, or finance.\n\n- Experience negotiating vendor, data, or infrastructure agreements.\n\n- Exposure to startups that have scaled quickly or inflected suddenly.\n\n- International operations or cross-border project experience.\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "2aa11ad16baadfdafd3b26ee033990e14b07a39e413b9845e6a32476c06d9388"
  },
  {
    "id": "operations",
    "title": "Operations",
    "description": "Operations\n\nWe’re looking for an exceptional, high-potential Operations Lead to design, build, and own the quality function at PI, the team ensuring our foundation models are trained on the highest-quality robotics datasets in the world. You’ll architect end-to-end processes, define success metrics, and build feedback loops that improve data accuracy and reliability, while leading a team of skilled operators in partnership with research and data collection to deliver vetted, trustworthy data at scale.\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nTell us about the most complex operational problem you’ve solved.\n\nWhat made it challenging, and how did you approach it?\n\nHave you ever replaced a process in your life or work with AI?\n\nWhat was it, and what impact did it have?\n\nHow have you used technology to improve outcomes in your past experiences?\n\nAs a manager, how do you bring out the best in your team?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "87c175b98ef1139dee376508b8f21be5bc888a1480b90828262820e5af75f1bc"
  },
  {
    "id": "fleet-maintenance-technician",
    "title": "Fleet Maintenance Technician",
    "description": "Field Service & Maintenance Technician\n\nAs a Fleet Service & Maintenance (FSM) Technician at Physical Intelligence, you will play a critical role in maintaining our fleet of advanced robotic systems. You will be responsible for the electrical and mechanical upkeep of robotic platforms, ensuring they are running at peak performance and minimizing downtime. This role requires skills in both mechanical systems and electrical components, including troubleshooting, diagnostics, and hands-on repairs.\n\nThe ideal candidate will have a blend of hands-on mechanical and electrical system repair expertise, be highly detail-oriented, and the ability to work in a dynamic, high-tech environment.\n\nName\n\nEmail\n\nPhone number\n\nResume\n\nUpload File\n\nWhy do you want to work at π?\n\nTell us about a challenging diagnostic / troubleshooting situation you encountered and how you resolved it.\n\nPlease list out some of the hardware tools you're most familiar with and your proficiency in fabrication, assembly, and repair.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "ef4115434f0a1ca99f4fb8bcced56fddabd08d329ce44959e3b5019992ae0494"
  },
  {
    "id": "field-diagnostics-%26-evaulation-engineer",
    "title": "Field Diagnostics & Evaulation Engineer",
    "description": "Field Diagnostics & Evaluation Engineer\n\nAs a Field Diagnostics & Evaluation Engineer (FDE) Engineer, you'll serve as the first line of technical defense for our growing fleet of robotic systems deployed across warehouse and data-collection environments. Our diverse robot fleet—including both static and mobile systems—performs complex manipulation and sensing tasks in real-world settings. When issues arise, you'll be the first responder: analyzing field tickets, reproducing issues, gathering diagnostic data, and driving resolution to ensure maximum fleet uptime.\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "2bf154ccd1b265cb0020e8c93daff4744ceb19ab8f3924c4a6469f1c7059b94d"
  },
  {
    "id": "internship",
    "title": "Internship",
    "description": "Internships\n\nWe are accepting applications for internships. While we have a very limited number of intern opportunities, we welcome applications in particular for research-focused internships at all levels.\n\nLinkedIn / GitHub / Personal Website\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nWhy do you want to work at π?\n\nWhat would you most like to work on?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from your research, to open source code or projects, to systems or software that you've built.\n\nPlease provide names and email addresses for one or two references that we could contact\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "32ca25cad2065802490250cf8b2ca77dc965fab046ac66e4b678e258a5cdcc29"
  },
  {
    "id": "mechatronics-internship",
    "title": "Mechatronics Internship",
    "description": "Mechatronics Intern\n\nWe're looking for someone who is fundamentally a builder. Someone who loves to make robots real. We want someone who’s as comfortable debugging a CAN bus issue as they are machining a bracket. An individual who thinks in systems, and who gets excited by tight integration between mechanical, electrical, and embedded design. You’ll join the hardware engineering team at Physical Intelligence (Pi) who is supporting the robots that power Pi’s data collection and model training operations.\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nPortofolio\n\nLinkedIn / GitHub / Personal Website\n\nWhy do you want to work at π?\n\nWhat would you most like to work on?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from your research, to open source code or projects, to systems or hardware that you've built.\n\nPlease provide one or two names and email addresses we can contact as references\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "aecc8fe6d259e4038d7784364e2c2d25ca52016dcf36cb524d2e3e9eca0fbced"
  },
  {
    "id": "hardware-systems-internship",
    "title": "Hardware Systems Internship",
    "description": "Hardware Systems Intern\n\nWe’re looking for a versatile Hardware Systems Engineering Intern to join our hardware team. This individual will support the development and improvement of critical infrastructure that supports our fleet’s health and uptime in a demanding hardware operation. What happens when you ask a robot to run a dishwasher for 8hrs a day? How hard is it really to make a cup of coffee? You’ll work alongside experienced mechanical and electrical engineers who are building the systems that enable robots to perform diverse tasks in warehouses as well as uncontrolled environments out in the wild.\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nPortfolio\n\nLinkedIn / GitHub / Personal Website\n\nWhy do you want to work at π?\n\nWhat would you most like to work on?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from your research, to open source code or projects, to systems or hardware that you've built.\n\nPlease provide one or two names and email addresses we can contact as references\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "c7473ec5ff75afbe86082017c0d7bab885f33f18bd39c2a470f952dd0b453f3c"
  },
  {
    "id": "shift-lead",
    "title": "Shift Lead",
    "description": "Shift Lead\n\nWe’re looking for an experienced Shift Lead to oversee day-to-day operations at our San Francisco site. In this role, you’ll be responsible for real-time execution on the floor — ensuring that people, processes, and equipment are aligned to meet daily production goals. You’ll coordinate staffing and priorities, maintain a steady operational rhythm, and communicate clearly with both operators and cross-functional teams to keep everything running smoothly.\n\nThis role covers 3pm to midnight.\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat are you most proud of accomplishing?\n\nAs a manager, how do you bring out the best in your team?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "4db0e5db0b4018da62107f609a2903872e1c976d8b596721b5167f47fa9d0622"
  },
  {
    "id": "robot-operator",
    "title": "Robot Operator",
    "description": "Robot Operator\n\nData collection is key to our mission, and as a Robot Operator, you’re essential to making that happen. Your role involves delivering high-quality, high-volume demonstrations of tasks by teleo-perating our robots. You’ll either lead the robot’s movements, which it mirrors, or guide it using controllers we have designed. These tasks can range from something as simple as folding a batch of laundry to more complex activities like multi-step electronics assembly.\n\nOur operators are meticulously detail-oriented, possess good dexterity, and enjoy taking on new challenges. If this sounds like you, we’d love to connect!\n\nName\n\nEmail\n\nPhone number\n\nResume\n\nUpload File\n\nShifts\n\nWhat shifts could you work?\n\n7am to 3:30pm\n\n3:30pm to 12am\n\n12am to 7am\n\nAvailability\n\nMonday\n\nTuesday\n\nWednesday\n\nThursday\n\nFriday\n\nSaturday\n\nSunday\n\nWhy are you excited to be a robot operator?\n\nTell me about a time when you disagreed with a rule or process and what you did about it.\n\nDo you find it easier to focus on tasks that require mental concentration or physical coordination? Can you provide an example?\n\nWhat are your hobbies?  Do you have any skills that  you would like to teach a robot?\n\nPlease  upload a video of you folding a shirt.\n\nLaundry folding is one of our bread and butter tasks. Please upload a video (maximum 15 seconds) of your best shirt folding strategy.\n\nUpload File\n\nAre you legally authorized to work in the United States without sponsorship now or in the future?\n\nYes\n\nNo\n\nThis position requires a successful completion of a background check as a condition of employment. Are you willing to undergo a background check as part of the application process?\n\nYes\n\nNo\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "ddadedd2e005ec85ab7c5e996d783d517f4cd937ab5316315965a91214d3d639"
  },
  {
    "id": "%3Cinsert-job-you-excel-at/%3E",
    "title": "<insert-job-you-excel-at/>",
    "description": "<insert-job-you-excel-at/>\n\nIf you feel you have something to contribute and you're a high-output person, we would love to explore working together in roles that we might not yet be hiring for. We make exceptions for exceptional people!\n\nName\n\nEmail\n\nLinkedIn\n\nResume\n\nUpload File\n\nWhat should we hire you for? Why?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "28236bdbd8ac65d202c576702dcdd4934b76122bbaf623aa45a76a5aaac1f084"
  }
]