[
  {
    "id": "research-scientist",
    "title": "Research Scientist",
    "location": "",
    "compensation": "",
    "description": "Research Scientist\n\nWe look for research scientists with a proven record of research accomplishments in robotics, machine learning, computer vision, and other related fields. If you enjoy building systems and bring a solid foundation in engineering, you’ll thrive in this role. That said, we’re not just looking for the conventional path — we’re excited about people who can make an impact, no matter their background.\n\nPersonal website or GitHub\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nWhy do you want to work at π?\n\nDescribe your research interests\n\nDescribe your most significant accomplishment or research result\n\nPlease provide names and email addresses for one or two references that we could contact\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "86fe5134739f3b6fc8423de93fa98db809429f020be5c4accd95a45ee50a3ebd"
  },
  {
    "id": "build-%26-release-engineer",
    "title": "Build & Release Engineer",
    "location": "",
    "compensation": "",
    "description": "Build & Release Engineer\n\nAs a Build & Release Engineer, you will own the infrastructure and developer platforms that underpin our engineering workflows. This includes GitHub-based CI/CD pipelines, Bazel build and test systems, cloud infrastructure, and Kubernetes services that allow engineers to ship reliably at scale.\n\nThis is a senior, hands-on infrastructure role focused on developer productivity, build reliability, and operational scale.\n\nThe Team\n\nThe Operations and Infrastructure teams support the real-world deployment and iteration of PI’s robotics systems. They are responsible for the platforms, tooling, and cloud environments that enable engineers to build, test, and deploy reliably. This includes ownership of GitHub workflows, CI systems, and build tooling that sit directly on the critical path of development.\n\nIn This Role You Will\n\n- CI/CD Ownership: Design and operate GitHub-based CI/CD systems (GitHub Actions, checks, workflows) with a focus on reliability, speed, and signal quality.\n\n- Build Systems: Own and evolve Bazel-based build and test infrastructure that supports C++, Python, Rust, and Typescript-based development.\n\n- Infrastructure Engineering: Build and maintain Kubernetes-based services and cloud infrastructure using Terraform and infrastructure-as-code.\n\n- Automation & Self-Service: Replace manual release, provisioning, and access workflows with automated, GitHub-integrated systems.\n\n- Reliability & Throughput: Reduce flaky builds, failed deploys, and CI bottlenecks that slow engineering velocity.\n\n- Cross-Team Enablement: Partner with engineers across the stack to make builds, tests, and deploys predictable and fast.\n\nWhat We Hope You’ll Bring\n\n- Strong experience operating GitHub-centric development workflows at scale.\n\n- Deep familiarity with CI/CD systems and build reliability challenges.\n\n- Experience with Bazel or similar large-scale build systems.\n\n- Proficiency in cloud infrastructure, Kubernetes, and Terraform.\n\n- Strong instincts for developer experience and operational leverage.\n\nBonus Points If You Have\n\n- Experience improving CI throughput for hundreds of engineers.\n\n- Expertise in Bazel optimization (remote caching, test sharding, incremental builds).\n\n- Security- or InfoSec-adjacent infrastructure automation.\n\n- Background in internal developer productivity or platform teams.\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "045e8a8c4551e0dbea2bc0de7b6f376e7bdda0975308f468ab07b71fbcbbab39"
  },
  {
    "id": "controls-engineer",
    "title": "Controls Engineer",
    "location": "",
    "compensation": "",
    "description": "Controls Engineer\n\nAs we advance our capabilities and scale our fleet of robotic systems, we’re hiring a Controls Engineer to own critical work at the intersection of controls, hardware, and robotic runtime. This role is highly hands-on and essential to ensuring that our systems are reliable, debuggable, and capable of supporting rapid research and deployment cycles.\n\nAn ideal candidate is a hands-on, systems-level thinker with deep expertise in controls and robot runtime, who thrives in quickly transforming environments and reliably delivers robust, field-ready robots.\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "9bb7458f6a4abe5c2684611e093cc207b5f8fbda5ded4fc135e1c2b8feadd0c3"
  },
  {
    "id": "electrical-engineer",
    "title": "Electrical Engineer",
    "location": "",
    "compensation": "",
    "description": "Electrical Engineer\n\nWe’re looking for a hands-on engineering leader to drive the strategy, architecture, and execution of our electrical systems. In this role, you’ll own the end-to-end design and development of PCBAs — from early concept and architecture through schematic design, layout, bring-up, validation, and mass production. You’ll maintain precise validation and test processes, and ensure our systems meet the highest standards for reliability and compliance.\n\nBeyond technical impact, you’ll set the direction for our electrical systems strategy, and foster a culture of collaboration, transparency, and first-principles problem solving.\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nWhy do you want to work at π?\n\nTell us about a project you worked on that you’re especially proud of and enjoyed.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "ca5fe2ce0bdfd770723c940a944d64fde2f6b5212ef48e66885a56ba7e405e4e"
  },
  {
    "id": "ml-infra-engineer",
    "title": "ML Infra Engineer",
    "location": "",
    "compensation": "",
    "description": "ML Infra Engineer\n\nWe are looking for engineers with expertise in machine learning systems, data pipelines, and large-scale training infrastructure. Successful candidates will have a proven record of accomplishment in building machine learning systems, working with large models in computer vision, language, or other areas, and an excellent understanding of machine learning infrastructure and systems fundamentals.\n\nThis is a very broad role that can be more focused on your specific area of expertise (e.g. data pipelines or large-scale training). You’ll be faced with challenges that other large-scale AI companies haven’t encountered. For example, unlike most foundation model companies, we don’t acquire our datasets through scraping the open internet, since the dataset we need to train our models largely doesn't exist. We generate petabytes of time-series data in-office and at offsite deployment locations, which then needs to be compressed, uploaded, processed, visualized and loaded onto gigantic training pipelines as efficiently as possible. If you’re up to the challenge, we’d love to hear from you!\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nWe're only hiring in SF at the moment. Please confirm you're willing/able to report to an office in SF for an onsite role?\n\nYes\n\nNo\n\nPlease detail the experience you have with ETL, cloud platforms, ML and ML systems, data pipelines, and large-scale training infrastructure.\n\nWhat is your super power (i.e. the unique value you’d bring to π)?\n\nWhen would you be able to start a new role?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "d2f96b1b4b2258dc5c45c7edd0649d6569861723d71690346301e6c88ce64795"
  },
  {
    "id": "ml-infra-engineer-%28data-systems%29",
    "title": "ML Infra Engineer (Data Systems)",
    "location": "",
    "compensation": "",
    "description": "ML Infra Engineer (Data Systems)\n\nAs an ML Infra Engineer (Data Systems), you’ll build and operate the data infrastructure that powers large-scale robot learning. Your systems will sit directly between raw data sources and training/evaluation, enabling us to move faster while maintaining performance, correctness, and reliability at scale.\n\nThis is a systems role at the intersection of distributed systems, storage, and machine learning infrastructure.\n\nThe Team\n\nThe Infrastructure organization builds the foundations that make large-scale learning possible at PI. This includes training systems, data platforms, evaluation pipelines, and the tooling that allows researchers and roboticists to work with massive datasets safely and efficiently.2\n\nIn This Role You Will\n\n- Data Ingestion & Processing: Design and build high-throughput pipelines that validate, transform, and featurize raw multimodal data.\n\n- Batch & Streaming Systems: Operate large-scale batch and streaming workflows over massive datasets.\n\n- Storage Systems: Design object storage layouts, metadata systems, and efficient access patterns; choose file formats with performance and scalability in mind.\n\n- Data Lifecycle Management: Build systems for backfills, dataset rebuilds, garbage collection, and large-scale transformations.\n\n- Training-Time Performance: Optimize dataloaders, sharding, prefetching, caching, and throughput to reduce time from data arrival → model training.\n\n- Metadata & Indexing: Build scalable metadata stores for datasets, annotations, and training artifacts.\n\n- Data Movement: Move hundreds of terabytes to petabytes efficiently across clusters and environments.\n\n- Operational Correctness: Implement observability, validation, and guardrails to prevent silent data regressions.\n\n- Cross-Functional Collaboration: Work closely with cross-functional teams of researchers, engineers and roboticists to translate evolving data needs into robust systems.\n\nWhat We Hope You’ll Bring\n\n- Strong software engineering fundamentals.\n\n- Experience building distributed systems or large-scale data pipelines.\n\n- Comfort reasoning about performance, memory, I/O, and storage efficiency.\n\n- Familiarity with batch and/or streaming processing systems.\n\n- Experience with object storage systems and data format tradeoffs.\n\n- Ownership mindset: design, build, operate, and iterate on systems end-to-end.\n\n- Enjoy working closely with researchers and unblocking fast-moving projects.\n\nBonus Points If You Have\n\n- Experience with large ML training pipelines or dataloading systems.\n\n- Knowledge of columnar or custom data formats.\n\n- Experience with systems like ClickHouse, Ray, Flink, Spark, or similar.\n\n- Hands-on experience operating petabyte-scale datasets.\n\n- Debugging and fixing performance bottlenecks in data-heavy systems.\n\nName\n\nEmail\n\nWebsite/LinkedIn/Github\n\nResume\n\nUpload File\n\nWhy do you want to work at π?\n\nWhat are some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nWe're only hiring in SF at the moment. Please confirm you're willing/able to report to an office in SF for an onsite role?\n\nYes\n\nNo\n\nPlease detail the experience you have with ETL, cloud platforms, ML and ML systems, data pipelines, and large-scale training infrastructure.\n\nWhat is your super power (i.e. the unique value you’d bring to π)?\n\nWhen would you be able to start a new role?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "42d05981cec890618df6d39873a46c0d8c46362efd36350423c6e5ee08ce4274"
  },
  {
    "id": "ml-infra-engineer-%28tpu/jax/optimization%29",
    "title": "ML Infra Engineer (TPU/Jax/Optimization)",
    "location": "",
    "compensation": "",
    "description": "ML Infra Engineer (TPU/Jax/Optimization)\n\nIn this role you will help scale and optimize our training systems and core model code. You’ll own critical infrastructure for large-scale training, from managing GPU/TPU compute and job orchestration to building reusable and efficient JAX training pipelines. You’ll work closely with researchers and model engineers to translate ideas into experiments—and those experiments into production training runs.\n\nThis is a hands-on, high-leverage role at the intersection of ML, software engineering, and scalable infrastructure.\n\nThe Team\n\nThe ML Infrastructure team supports and accelerates PI’s core modeling efforts by building the systems that make large-scale training reliable, reproducible, and fast. The team works closely with research, data, and platform engineers to ensure models can scale from prototype to production-grade training runs.\n\nIn This Role You Will\n\n- Own training/inference infrastructure: Design, implement, and maintain systems for large-scale model training, including scheduling, job management, checkpointing, and metrics/logging.\n\n- Scale distributed training: Work with researchers to scale JAX-based training across TPU and GPU clusters with minimal friction.\n\n- Optimize performance: Profile and improve memory usage, device utilization, throughput, and distributed synchronization.\n\n- Enable rapid iteration: Build abstractions for launching, monitoring, debugging, and reproducing experiments.\n\n- Manage compute resources: Ensure efficient allocation and utilization of cloud-based GPU/TPU compute while controlling cost.\n\n- Partner with researchers: Translate research needs into infra capabilities and guide best practices for training at scale.\n\n- Contribute to core training code: Evolve JAX model and training code to support new architectures, modalities, and evaluation metrics.\n\nWhat We Hope You’ll Bring\n\n- Strong software engineering fundamentals and experience building ML training infrastructure or internal platforms.\n\n- Hands-on large-scale training experience in JAX (preferred), PyTorch.\n\n- Familiarity with distributed training, multi-host setups, data loaders, and evaluation pipelines.\n\n- Experience managing training workloads on cloud platforms (e.g., SLURM, Kubernetes, GCP TPU/GKE, AWS).\n\n- Ability to debug and optimize performance bottlenecks across the training stack.\n\n- Strong cross-functional communication and ownership mindset.\n\nBonus Points If You Have\n\n- Deep ML systems background (e.g., training compilers, runtime optimization, custom kernels).\n\n- Experience operating close to hardware (GPU/TPU performance tuning).\n\n- Background in robotics, multimodal models, or large-scale foundation models.\n\n- Experience designing abstractions that balance researcher flexibility with system reliability.\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nWe're only hiring in SF at the moment. Please confirm you're willing/able to report to an office in SF for an onsite role?\n\nYes\n\nNo\n\nPlease detail the experience you have with ETL, cloud platforms, ML and ML systems, data pipelines, and large-scale training infrastructure.\n\nWhat is your super power (i.e. the unique value you’d bring to π)?\n\nWhen would you be able to start a new role?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "6b63f4e937b52cf46528a096528c4d2c0d05575d8a7128227a9c8e4e622fbe0a"
  },
  {
    "id": "mechanical-design-engineer",
    "title": "Mechanical Design Engineer",
    "location": "",
    "compensation": "",
    "description": "Mechanical Design Engineer\n\nWe're looking for an experienced mechanical design engineer to drive the integration and development of our robotic systems, leading innovative designs from concept to deployment. You'll own the full spectrum of mechanical development—from actuator sizing or design to kinematics and work with teams to prototype and ultimately produce systems at scale—ensuring reliability, deployability, and performance. The ideal candidate is a hands-on innovator with deep expertise in mechatronic systems, combining theoretical knowledge with practical engineering skills. Experience with actuation systems, electromechanical integration, machine design, and a track record of bringing mechanical systems to life is essential. If this sounds like you, please apply!\n\nWebsite URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nWhy do you want to work at π?\n\nTell us about a project you worked on that you’re especially proud of and enjoyed.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "da24a903896258cf362660e47dc9572211c3c2b791a80290f35fcf9d015f5987"
  },
  {
    "id": "robotics-systems-engineer",
    "title": "Robotics Systems Engineer",
    "location": "",
    "compensation": "",
    "description": "Robotics Systems Engineer\n\nWe’re looking for software engineers that thrive on building the infrastructure that makes robotic systems reliable, observable, and scalable. You’ll design and maintain systems that maximize robot uptime, automate deployment, and accelerate data collection and evaluation pipelines. Strong skills in diagnostics, observability, and debugging complex distributed systems will be key, along with a mindset for creating resilient frameworks that adapt to diverse hardware platforms. The work you do here won’t just stay in the lab — it will shape how robots around the world learn and interact with their environments.\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nGitHub or Website URL\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "e4619f035cbb8840a0c69f982f083862f52c53de6fb6110dabd7b15af2e95929"
  },
  {
    "id": "runtime-generalist-engineer",
    "title": "Runtime Generalist Engineer",
    "location": "",
    "compensation": "",
    "description": "Runtime Generalist Engineer\n\nAchieving real-world performance requires extremely tight system latency, reliable sensor pipelines, and end-to-end engineering that makes perception and control loops work at real-time speeds.\n\nAs a Runtime Software Engineer, you’ll engineer the low-latency, high-throughput systems that underpin our physical intelligence model. You won’t be designing ML models - you’ll be the person who makes them run flawlessly in production, optimizing every layer from OS to camera pipeline to networking. You’ll collaborate closely with researchers, platform engineers, and robotics operators to identify bottlenecks and extract maximum performance from the entire system.\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "0b64cb4e90f20b48b14a356bd15a463e9194d084ec5dc617881072b3a2076313"
  },
  {
    "id": "head-of-creative",
    "title": "Head of Creative",
    "location": "",
    "compensation": "",
    "description": "Head of Creative\n\nWe’re looking for a Head of Creative to shape how the world sees and experiences Physical Intelligence. We’ve been focused on the technical breakthroughs, but now, we need someone to tell our story, beyond the lab. You’ll help define the values, voice, and creative direction that guide everything we put into the world, and work hands-on to communicate that internally and externally. From our website to launching videos, from the way we explain our work to how we celebrate releases and show pride in our team, your influence will be felt across every touchpoint.\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nWhy do you want to work at  π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "231e5d7605cef13ca7ecbf88fb814532f3568a5ce084cdb59f6d6a241d8b3e68"
  },
  {
    "id": "hr-business-partner",
    "title": "HR Business Partner",
    "location": "",
    "compensation": "",
    "description": "HR Business Partner\n\nAs the company scales, success increasingly depends not just on research excellence, but on building people systems that let teams move fast without tripping over process gaps, inconsistent manager practices, or preventable compliance risk.\n\nSuccess in this role looks like a People partnership that “just works” across both our hourly operations teams and our R&D teams: managers get crisp guidance, employees get consistent answers, and high-risk issues are prevented rather than cleaned up later.\n\nThe Team\n\nThis role sits within the People team, and is the dedicated HRBP for Operations plus our core R&D functions (Research, Hardware, Engineering). It works cross-functionally with leaders across those orgs, People Ops (policy/HRIS), Recruiting, Payroll, Finance, and Legal/external counsel.\n\nThere is no narrow lane: the mandate is to flex between day-to-day HR execution and higher-leverage business partnering, ensuring that our practices scale appropriately for both hourly and exempt populations.\n\nIn This Role You Will\n\n- Own the end-to-end HRBP partnership for Operations, Research, Hardware, and Engineering: be embedded with leaders, bringing structure, judgment, and speed to people decisions.\n\n- Drive org health and execution for R&D: partner with Research/Hardware/Engineering leaders on org design, talent planning, role clarity, team health, and change management as we scale.\n\n- Run performance management support and the review cycle: set expectations, coach managers on feedback and documentation, facilitate calibrations, and ensure consistent standards across teams and levels.\n\n- Partner on compensation and internal mobility: support promotions, transfers, raises, bonuses, and leveling decisions with fairness, market awareness, and clear documentation.\n\n- Own hourly compliance and guardrails: timekeeping/clock-in-out practices, meal/rest compliance, attendance and leave administration, and manager behaviors that create or reduce wage/hour risk; partner with Payroll/Legal on audits and corrections.\n\n- Streamline onboarding and offboarding across employee types (operators, technicians, engineers/researchers): align stakeholders (Ops/Recruiting/IT/Payroll), build checklists and comms, and ensure compliance diligence (I-9s, background checks, required trainings).\n\n- Serve as first-line triage for benefits, leave, and immigration questions (plan coverage, life events, parental/disability leave, visas/transfers): coordinate with brokers/carriers and counsel so employees get fast, accurate answers and leaders are not bottlenecked.\n\n- Build manager enablement and policy implementation: deliver management training for warehouse shift leads and first-time managers across the company; keep the handbook and policies current and workable (PTO/holidays by population, trainings, safety reporting), partnering with Anna and Legal for light legal execution.\n\nWhat We Hope You’ll Bring\n\n- 4+ years in an HRBP / People Partner role supporting high-performing technical orgs (Engineering/Research) and/or operations/technician teams in a fast-growing environment.\n\n- Strong foundational knowledge of California employment law and HR compliance basics (wage/hour, leaves, I-9, required trainings), and the judgment to know when to escalate to Legal.\n\n- Hands-on employee relations experience: investigations, performance management, terminations, and creating documentation that stands up to scrutiny - with high empathy and low drama.\n\n- Credible business partnership skills: ability to advise leaders on org design, role clarity, hiring plans, and team health; comfortable influencing without authority.\n\n- Operational excellence: you can design and run repeatable people programs (onboarding/offboarding, case management, training completion tracking, policy rollouts) with high reliability.\n\n- Comfort partnering with Payroll and Benefits (plan changes, life events) and with immigration counsel/vendors (visa processing, compliance) without becoming a bottleneck.\n\n- A pragmatic, high-credibility coaching style for managers at all levels - from shift leads to senior IC/manager populations - with clear expectations and strong follow-through.\n\n- Exceptional written and verbal communication, discretion, and integrity: you keep stakeholders aligned, deliver sensitive messages with care, and operate with high trust.\n\nBonus Points If You Have\n\n- Experience as an HRBP in an R&D-heavy environment (robotics, hardware, labs) where roles evolve quickly and leaders need real-time guidance.\n\n- Experience scaling HR practices for an hourly workforce (warehouse/field) including wage/hour risk controls, timekeeping practices, and audit readiness.\n\n- Experience building career ladders and performance frameworks for both operators/technicians and engineers (levels, expectations, calibration rhythms).\n\n- Familiarity coordinating immigration and global mobility workflows (visas, transfers, vendor/counsel management).\n\n- Experience building manager training programs (first-time manager, shift lead) and measuring adoption/outcomes (training completion, incident rates, escalation volume).\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "97af601337e1c88e699445f5da3214842b7b150f72bc9cae419b8ed2a620b45d"
  },
  {
    "id": "business-operations",
    "title": "Business Operations",
    "location": "",
    "compensation": "",
    "description": "Business Operations\n\nWho We Are\n\nPhysical Intelligence is bringing general-purpose AI into the physical world. We are a group of engineers, scientists, roboticists, and company builders developing foundation models and learning algorithms to power the robots of today and the physically-actuated devices of the future.\n\nAs the company scales, success increasingly depends not just on research excellence, but on strong business execution - across partnerships, operations, infrastructure, and deployment.\n\nSuccess in this role looks like independently identifying the highest-leverage problems, structuring them into executable plans, and driving them to measurable outcomes with minimal founder involvement.\n\nThe Team\n\nThis role sits close to the founders and works cross-functionally with research, engineering, operations, finance, legal, and external partners. There is no single “lane”, the mandate is to add leverage wherever the company most needs it.\n\nIn This Role You Will\n\n- Own and execute cross-functional projects with high ambiguity and real business impact.\n\n- Drive data, compute, and infrastructure partnerships, from sourcing through negotiation and management.\n\n- Plug into deployment efforts: sourcing opportunities, structuring contracts, pricing, and operational setup.\n\n- Assist with and drive internal scaling initiatives such as office expansion, international operations, and company planning.\n\n- Support investor, board, and external communications including decks, analyses, and prep.\n\n- Act as an execution arm for founders and leaders, translating priorities into outcomes.\n\nWhat We Hope You’ll Bring\n\n- Strong analytical and strategic instincts with a bias toward action.\n\n- Comfort operating independently in ambiguous environments.\n\n- Commercial mindset and basic financial fluency (contracts, pricing, tradeoffs).\n\n- Exceptional written and verbal communication.\n\n- Willingness to do anything, paired with strong prioritization instincts and comfort pushing back when work is low-leverage.\n\n- Strong π-fit: respect for research and engineering culture, curiosity, and intellectual humility.\n\nBonus Points If You Have\n\n- Background in consulting, venture capital, private equity, or finance.\n\n- Experience negotiating vendor, data, or infrastructure agreements.\n\n- Exposure to startups that have scaled quickly or inflected suddenly.\n\n- International operations or cross-border project experience.\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "2aa11ad16baadfdafd3b26ee033990e14b07a39e413b9845e6a32476c06d9388"
  },
  {
    "id": "operations",
    "title": "Operations",
    "location": "",
    "compensation": "",
    "description": "Operations\n\nWe’re looking for an exceptional, high-potential Operations Lead to design, build, and own the quality function at PI, the team ensuring our foundation models are trained on the highest-quality robotics datasets in the world. You’ll architect end-to-end processes, define success metrics, and build feedback loops that improve data accuracy and reliability, while leading a team of skilled operators in partnership with research and data collection to deliver vetted, trustworthy data at scale.\n\nGitHub or Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedIn\n\nTell us about the most complex operational problem you’ve solved.\n\nWhat made it challenging, and how did you approach it?\n\nHave you ever replaced a process in your life or work with AI?\n\nWhat was it, and what impact did it have?\n\nHow have you used technology to improve outcomes in your past experiences?\n\nAs a manager, how do you bring out the best in your team?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "87c175b98ef1139dee376508b8f21be5bc888a1480b90828262820e5af75f1bc"
  },
  {
    "id": "workplace-manager",
    "title": "Workplace Manager",
    "location": "",
    "compensation": "",
    "description": "Workplace Manager\n\nWho We Are\n\nPhysical Intelligence is bringing general-purpose AI into the physical world. We are a group of engineers, scientists, roboticists, and company builders developing foundation models and learning algorithms to power the robots of today and the physically-actuated devices of the future.\n\nAs the company scales, success increasingly depends not just on research excellence, but on building an environment where teams can consistently operate at a high tempo—with minimal friction and a strong sense of belonging.\n\nSuccess in this role looks like building and operating a workplace that “just works”: day-to-day operations are quiet and reliable, employees feel supported and welcomed, and the workplace becomes a competitive advantage for focus, collaboration, and retention.\n\nThe Team\n\nThis role is a key partner to People/Operations and works cross-functionally with Research, Engineering, IT, Finance, Legal, and external vendors (building management, contractors, security, A/V, furniture, etc.). It sits close to leadership priorities because workplace decisions directly affect productivity, culture, and cost.\n\nThere is no narrow lane: the mandate is to own workplace outcomes end-to-end and continuously improve how the office functions as we scale.\n\nIn This Role You Will\n\nOwn day-to-day workplace operations to keep the office running smoothly (facilities issues, supplies, conference rooms, mail, visitors, onsite support, shared spaces).\n\nBuild and manage the vendor ecosystem (janitorial, security, access control, furniture, catering, repairs, IT/AV partners, etc.), including sourcing, negotiating, and performance management.\n\nCreate scalable workplace systems and processes (ticketing/intake, procurement workflows, inventory, onboarding checklists, documentation, office norms) that reduce interruptions and increase reliability.\n\nPartner with People Ops on holistic employee experience, including onboarding moments, in-office rituals, events, and programming that reinforces belonging and connection - all while facilitating focused work.\n\nSupport wellness-oriented workplace practices, such as ergonomic setups, workspace standards, healthy routines, and clear guidance/resources—coordinating with benefits/People where applicable.\n\nDrive health, safety, and preparedness basics, including emergency planning, incident response readiness, first aid supplies, and safety guidelines appropriate for our work environment.\n\nOwn workplace budgets and planning, tracking spend, identifying cost-saving opportunities, and making high-ROI investments that improve the employee experience and reduce friction.\n\nAct as the “quiet operator” behind a great office, anticipating issues before they happen and ensuring employees can stay focused on mission-critical work.\n\nWhat We Hope You’ll Bring\n\nProven ownership in workplace operations / office management / facilities / employee experience, ideally in a fast-moving environment.\n\nStrong project management skills, with a track record of delivering complex, deadline-driven work (an office move experience is a major plus).\n\nOperational rigor and attention to detail—you notice what’s broken, fix it quickly, and prevent repeats.\n\nVendor and budget fluency, including negotiating, managing contracts, and making practical tradeoffs.\n\nHigh EQ and service mindset, paired with strong boundaries and prioritization instincts (helpful, responsive, and able to protect team focus).\n\nExceptional written and verbal communication, especially for coordinating across stakeholders and setting clear expectations.\n\nComfort with ambiguity and building structure, including creating processes that scale without becoming bureaucratic.\n\nStrong π-fit: respect for research/engineering culture, good judgment, intellectual humility, and a bias toward enabling others.\n\nBonus Points If You Have\n\nLed or supported an office move (planning, vendors, comms, execution, post-move stabilization).\n\nExperience in R&D-heavy environments (labs, robotics, hardware-adjacent workplaces) where safety, equipment, and space needs are more complex than a standard office.\n\nFacilities/safety exposure, such as emergency planning, basic compliance coordination, or ergonomic program ownership.\n\nExperience scaling a workplace from early-stage (<100) through growth (100–300+), including space planning and policy evolution.\n\nStrong hospitality instincts, creating a workplace experience that feels intentional, welcoming, and high-quality without being “fluffy.”\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nGithub or Website URL\n\nLinkedIn\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "197761f06e8e0b3ed26abef82b7013448dfe9b1b90d5a968c53915710b7a526e"
  },
  {
    "id": "robot-test-engineer",
    "title": "Robot Test Engineer",
    "location": "",
    "compensation": "",
    "description": "Robot Test Engineer\n\nAs a Robot Test Engineer, your role is critical to ensuring that robot systems integrating into our growing robot fleet meet performance requirements and are reliable. You will work with robot systems across a range of maturity levels from early prototypes to production systems. You will be responsible for creating test systems and test processes/documentation, executing tests on robotic systems, and engaging with members of the hardware engineering and software engineering teams to resolve issues that arise during test.\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "37d2a316ead757cf6f8099dc44cf830379b112cb9ada9326f7c54931d3943529"
  },
  {
    "id": "lab-manager",
    "title": "Lab Manager",
    "location": "",
    "compensation": "",
    "description": "Lab Manager\n\nAs a Lab Manager, you will be responsible for overseeing our hardware prototyping and test lab. This person is a highly organized individual who will play a central role in maintaining and scaling the physical infrastructure that enables our robotics teams to design, build, and iterate rapidly. You’ll ensure that the lab runs safely, efficiently, and smoothly bridge engineering and fabrication as we scale our robot fleet.\n\nKey Responsibilities\n\n- Turn digital part files into finished parts using 3D printing, laser cutting, and assembly processes.\n\n- Manage a fleet of prototyping tools - Bambu FDM printers, Formlabs SLS & SLA printers, Epilog Laser cutter, various hand tools (drills, saws, sander), ensuring they are maintained and ready for use.\n\n- Lab Safety and Process: Implement and enforce lab procedures for fabrication, part storage, ESD safety, hazardous material handling, PPE requirements, and tool calibration.\n\n- Lab Inventory: Maintain and manage quantities of raw materials (acrylics, plastic filament, resin, screws, inserts etc) and common off-the-shelf parts for prototyping.\n\n- Lab Expansion:Plan layout, tooling upgrades, and process improvements as the hardware team scales.\n\nRequired Competencies & Skills\n\n- Shop/Lab Manager Work Experience: 2+ years as a lab or shop manager with experience mentoring and managing team of technicians.\n\n- Prototype Equipment Experience: Knowledge and experience running prototyping equipment - 3D printers, laser cutters, machine tools.\n\n- Hands-On Skills: Experience assembling plastic and metal parts. Inserts, adhesives, torque wrenches, etc. Operate bandsaws, belt sanders and basic mill and lathe. Basic electrical/wiring experience (Soldering, cable routing, multimeter, harness repair)\n\n- CAD Experience - OnShape preferred, SolidWorks possible\n\n- Design for Manufacturing (DFM) Experience - Experience modifying parts for particular 3D printing processes and printing in the optimal orientation to meet design requirements\n\n- Inventory Management and Purchasing: Experience managing inventory of hardware parts and tools for the lab. Experience purchasing stock of inventory.\n\n- Documentation: Experience creating and maintaining documentation on lab processes or training guides for new hires.\n\n- Other Facets: High attention to detail, highly organized, capable of supporting multiple ongoing projects at the same time. Ability to enforce lab discipline.\n\nPreferred Skills\n\n- Familiarity with robotics hardware systems (actuators, sensors, controllers, cabling).\n\n- Proficiency with re-work of boards and debugging electrical systems\n\n- Experience with vendor management and outsourced fabrication or assembly\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "ab1333a7066805d6e85ba6b83fe55ab4c9051f26209073932afe1c4bb09ed8f4"
  },
  {
    "id": "robotics-service-technician",
    "title": "Robotics Service Technician",
    "location": "",
    "compensation": "",
    "description": "Robotics Service Technician\n\nAs a Robotics Service Technician at Physical Intelligence, you will play a critical role in maintaining our fleet of advanced robotic systems. You will be responsible for the electrical and mechanical upkeep of robotic platforms, ensuring they are running at peak performance and minimizing downtime. This role requires skills in both mechanical systems and electrical components, including troubleshooting, diagnostics, and hands-on repairs.\n\nThe ideal candidate will have a blend of hands-on mechanical and electrical system repair expertise, be highly detail-oriented, and the ability to work in a dynamic, high-tech environment.\n\nName\n\nEmail\n\nPhone number\n\nResume\n\nUpload File\n\nWhy do you want to work at π?\n\nTell us about a challenging diagnostic / troubleshooting situation you encountered and how you resolved it.\n\nPlease list out some of the hardware tools you're most familiar with and your proficiency in fabrication, assembly, and repair.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "e40c104b2d44b5e232a69015792b427ba79f537f11e6294eeaabb50918bfce80"
  },
  {
    "id": "forward-deployed-robotics-engineer",
    "title": "Forward Deployed Robotics Engineer",
    "location": "",
    "compensation": "",
    "description": "Forward Deployed Robotics Engineer\n\nAs a Forward Deployed Robotics Engineer, you'll serve as the first line of technical defense for our growing fleet of robotic systems deployed across warehouse and data-collection environments. Our diverse robot fleet—including both static and mobile systems—performs complex manipulation and sensing tasks in real-world settings. When issues arise, you'll be the first responder: analyzing field tickets, reproducing issues, gathering diagnostic data, and driving resolution to ensure maximum fleet uptime.\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from developing an open source library that took off, to founding a company, to an award you've won.\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "a92c2366a78a5cb04672b181e8364ce5c61e3654714f34af70542359bd8a6daa"
  },
  {
    "id": "internship",
    "title": "Internship",
    "location": "",
    "compensation": "",
    "description": "Internships\n\nWe are accepting applications for internships. While we have a very limited number of intern opportunities, we welcome applications in particular for research-focused internships at all levels.\n\nLinkedIn / GitHub / Personal Website\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nWhy do you want to work at π?\n\nWhat would you most like to work on?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from your research, to open source code or projects, to systems or software that you've built.\n\nPlease provide names and email addresses for one or two references that we could contact\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "32ca25cad2065802490250cf8b2ca77dc965fab046ac66e4b678e258a5cdcc29"
  },
  {
    "id": "mechatronics-internship",
    "title": "Mechatronics Internship",
    "location": "",
    "compensation": "",
    "description": "Mechatronics Intern\n\nWe're looking for someone who is fundamentally a builder. Someone who loves to make robots real. We want someone who’s as comfortable debugging a CAN bus issue as they are machining a bracket. An individual who thinks in systems, and who gets excited by tight integration between mechanical, electrical, and embedded design. You’ll join the hardware engineering team at Physical Intelligence (Pi) who is supporting the robots that power Pi’s data collection and model training operations.\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nPortofolio\n\nLinkedIn / GitHub / Personal Website\n\nWhy do you want to work at π?\n\nWhat would you most like to work on?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from your research, to open source code or projects, to systems or hardware that you've built.\n\nPlease provide one or two names and email addresses we can contact as references\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "aecc8fe6d259e4038d7784364e2c2d25ca52016dcf36cb524d2e3e9eca0fbced"
  },
  {
    "id": "hardware-systems-internship",
    "title": "Hardware Systems Internship",
    "location": "",
    "compensation": "",
    "description": "Hardware Systems Intern\n\nWe’re looking for a versatile Hardware Systems Engineering Intern to join our hardware team. This individual will support the development and improvement of critical infrastructure that supports our fleet’s health and uptime in a demanding hardware operation. What happens when you ask a robot to run a dishwasher for 8hrs a day? How hard is it really to make a cup of coffee? You’ll work alongside experienced mechanical and electrical engineers who are building the systems that enable robots to perform diverse tasks in warehouses as well as uncontrolled environments out in the wild.\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nPortfolio\n\nLinkedIn / GitHub / Personal Website\n\nWhy do you want to work at π?\n\nWhat would you most like to work on?\n\nWhat're some examples of your extraordinary accomplishments?\n\nWe're interested in hearing about your proudest accomplishments—anything from your research, to open source code or projects, to systems or hardware that you've built.\n\nPlease provide one or two names and email addresses we can contact as references\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "c7473ec5ff75afbe86082017c0d7bab885f33f18bd39c2a470f952dd0b453f3c"
  },
  {
    "id": "shift-lead",
    "title": "Shift Lead",
    "location": "",
    "compensation": "",
    "description": "Shift Lead\n\nWe’re looking for an experienced Shift Lead to oversee day-to-day operations at our San Francisco site. In this role, you’ll be responsible for real-time execution on the floor — ensuring that people, processes, and equipment are aligned to meet daily production goals. You’ll coordinate staffing and priorities, maintain a steady operational rhythm, and communicate clearly with both operators and cross-functional teams to keep everything running smoothly.\n\nThis role covers 3pm to midnight.\n\nGithub or  Website URL\n\nName\n\nEmail\n\nResume\n\nUpload File\n\nLinkedin\n\nWhy do you want to work at π?\n\nWhat are you most proud of accomplishing?\n\nAs a manager, how do you bring out the best in your team?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "4db0e5db0b4018da62107f609a2903872e1c976d8b596721b5167f47fa9d0622"
  },
  {
    "id": "robot-operator",
    "title": "Robot Operator",
    "location": "",
    "compensation": "",
    "description": "Robot Operator\n\nData collection is key to our mission, and as a Robot Operator, you’re essential to making that happen. Your role involves delivering high-quality, high-volume demonstrations of tasks by teleo-perating our robots. You’ll either lead the robot’s movements, which it mirrors, or guide it using controllers we have designed. These tasks can range from something as simple as folding a batch of laundry to more complex activities like multi-step electronics assembly.\n\nOur operators are meticulously detail-oriented, possess good dexterity, and enjoy taking on new challenges. If this sounds like you, we’d love to connect!\n\nName\n\nEmail\n\nPhone number\n\nResume\n\nUpload File\n\nShifts\n\nWhat shifts could you work?\n\n7am to 3:30pm\n\n3:30pm to 12am\n\n12am to 7am\n\nAvailability\n\nMonday\n\nTuesday\n\nWednesday\n\nThursday\n\nFriday\n\nSaturday\n\nSunday\n\nWhy are you excited to be a robot operator?\n\nTell me about a time when you disagreed with a rule or process and what you did about it.\n\nDo you find it easier to focus on tasks that require mental concentration or physical coordination? Can you provide an example?\n\nWhat are your hobbies?  Do you have any skills that  you would like to teach a robot?\n\nPlease  upload a video of you folding a shirt.\n\nLaundry folding is one of our bread and butter tasks. Please upload a video (maximum 15 seconds) of your best shirt folding strategy.\n\nUpload File\n\nAre you legally authorized to work in the United States without sponsorship now or in the future?\n\nYes\n\nNo\n\nThis position requires a successful completion of a background check as a condition of employment. Are you willing to undergo a background check as part of the application process?\n\nYes\n\nNo\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "ddadedd2e005ec85ab7c5e996d783d517f4cd937ab5316315965a91214d3d639"
  },
  {
    "id": "%3Cinsert-job-you-excel-at/%3E",
    "title": "<insert-job-you-excel-at/>",
    "location": "",
    "compensation": "",
    "description": "<insert-job-you-excel-at/>\n\nIf you feel you have something to contribute and you're a high-output person, we would love to explore working together in roles that we might not yet be hiring for. We make exceptions for exceptional people!\n\nName\n\nEmail\n\nLinkedIn\n\nResume\n\nUpload File\n\nWhat should we hire you for? Why?\n\nSubmit Application\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPowered by",
    "description_hash": "28236bdbd8ac65d202c576702dcdd4934b76122bbaf623aa45a76a5aaac1f084"
  }
]