[
  {
    "id": "hardware-support-engineer-redwood-city-ca",
    "title": "Hardware Support Engineer",
    "location": "Redwood City, CA",
    "compensation": "$90K – $160K • Offers Equity",
    "description": "## Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round.We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\nLearn more at dyna.co\n\n\n## Position Overview:\nAs a Hardware Support Engineer at Dyna Robotics, you will play a critical role in ensuring the reliability and efficiency of our robotic systems. Your responsibilities will include maintaining and repairing robots, sourcing and assembling robotic parts, designing and fabricating 3D printed parts and developing and implementing software checks. You will also be responsible for setting up teleoperation rigs for data collection both in our lab and at client locations. Additionally, you will collaborate closely with the data collection team to optimize our data collection processes, ensuring that our robots are always in top working condition and contributing to the advancement of our goals.\nKey Responsibilities:\n• Work with engineers to fabricate, assemble, and integrate robot prototypes, including mechanical assemblies, electrical systems, wire harnesses, etc.\n• Source robotic parts and assemble them in the lab or at client locations, ensuring all components meet quality standards.\n• Set up teleoperation rigs for data collection, both in the lab and on-site at client locations.\n• Develop and execute test plans, including the construction of assembly jigs and test/validation systems.\n• Collaborate with engineering teams to diagnose and resolve mechanical and electrical issues in robotic systems.\n• Maintain a clean and organized lab, ensuring it is stocked with necessary tools, components, and materials.\n• Support bench-top electrical system builds and testing, including tracking and documenting components and results.\n• Assist in low-volume prototype part builds and testing, including developing Standard Operating Procedures (SOPs), training modules, and ensuring repair for serviceability.\nQualifications:\n• 1+ years of experience as an Engineering Technician in fields such as Robotics, Automotive Service, Precision Medical Devices, R&D, or Manufacturing.\n• Experience sourcing and assembling robotic parts, and setting up teleoperation rigs.\n• Proven ability to collaborate with engineering teams to diagnose and resolve mechanical, electrical, and software issues, with the capacity to provide detailed written and verbal updates to key stakeholders.\n• Hands-on experience with hand and power tools, high & low voltage systems, wire harness assembly and repair, mechanical components, electro-mechanical devices, soldering irons, wire crimping tools, DMM multi-meters, and oscilloscopes.\n• Ability to interpret and work from drawings and 3D CAD models, including reading and understanding mechanical & electrical diagrams and schematics.\n• Familiarity with fundamental computer systems operations like the shell command line, Linux, Python scripting, and networking debugging.\n• Strong analytical problem-solving skills, including root cause analysis, troubleshooting, and detailed lab reporting.\n• Must be able to be on site in Redwood City five days a week, with occasional travel to client locations.\nPreferred Qualifications:\n• Experience with robotic systems, automation, or related fields.\n• Experience with CAD (especially Onshape, but also CATIA, SolidWorks, etc.), electrical design (e.g., Altium), fabrication/machining, 3D printing, and laser cutting equipment.\n• Knowledge of software development for hardware integration and support.\n• Background in designing and implementing testing and validation procedures.\n• Familiarity with agile methodologies and fast-paced startup environments.\nCompensation Range: $90K - $160K",
    "description_hash": "d47fa0bbd3327eaebcdabda67592373440e8a2162fd3af68429fcfc164302300"
  },
  {
    "id": "senior-robotics-hardware-engineer-redwood-city-ca",
    "title": "Senior Robotics Hardware Engineer",
    "location": "Redwood City, CA",
    "compensation": "$130K – $160K • Offers Equity",
    "description": "## Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round.We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\nLearn more at dyna.co\n\n\n## Position Overview:\nDyna Robotics is seeking an innovative Sr. Robotics Hardware Engineer to lead the design and development of advanced robotic systems for dexterous robotic manipulation—an essential foundation for our go-to-market applications and our vision of adaptable, multi-functional robots. In this role, you will oversee the full lifecycle of robotic system development, including concept generation, prototyping, performance testing, and integration with AI-driven control systems. Your expertise will play a pivotal role in shaping Dyna Robotics' immediate product milestones and establishing a distinct competitive edge in the robotic industry.\n\n\n## Key Responsibilities:\n• Design and develop mechanical components and assemblies using CAD tools (e.g., SolidWorks, Fusion 360, Onshape).\n• Build and prototype robotic systems, including 3D printing, machining, and electronics assembly.\n• Debug hardware issues across mechanical, electrical, and basic firmware domains.\n• Integrate and test various sensors with the research and eng teams, like tactile sensors, force sensors, etc.\n• Develop and maintain test setups for hardware validation.\n• Write basic scripts or firmware (e.g., in Python or C/C++) to support hardware bring-up and testing.\n• Document designs, test results, and procedures in a clear and organized manner.\n\n\n## Minimum Qualifications:\n• Bachelor's degree in Mechanical Engineering, Robotics, Mechatronics, or a related field.\n• 3+ years of experience in designing, developing, and integrating robotic systems\n• Experience with CAD tools (e.g., SolidWorks, Fusion 360).\n• Hands-on experience with hardware prototyping and debugging.\n• Familiarity with basic electronics (e.g., soldering, wiring, multimeter/oscilloscope use).\n• Comfortable writing basic code for hardware testing (Python, C/C++).\n• Strong problem-solving skills and a willingness to work hands-on with hardware.\n\n\n## Preferred Qualifications:\n• Experience working with robotic arms, grippers, or tactile sensing systems.\n• Familiarity with embedded systems or microcontrollers (e.g., STM32, Arduino, Raspberry Pi).\n• Knowledge of sensor interfacing (I2C, SPI, analog, CAN).\n• Experience with 3D printing, CNC machining, or laser cutting.\n• Prior work in a startup, research lab, or fast-paced prototyping environment.\n• Strong written documentation and communication skills.\nCompensation Range: $130K - $160K",
    "description_hash": "887edfac6ceb41cabcf9d32e26967040068070a336c385b66367fd3cd9e807a7"
  },
  {
    "id": "senior-robotics-software-engineer-redwood-city-ca",
    "title": "Senior Robotics Software Engineer",
    "location": "Redwood City, CA",
    "compensation": "$180K – $270K • Offers Equity",
    "description": "## Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round. We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\nLearn more at dyna.co\n\n\n## Position Overview:\nAs a Robotics Software Engineer at Dyna Robotics, you will play a pivotal role in developing a wide range of software that interfaces with our cutting-edge robotic systems. You will lead design and development of software systems for robot control, sensing, and teleoperation. You will also develop systems and tools for remote teleoperation, data collection and processing, metrics, and more. You will collaborate closely with our AI research and hardware teams to enhance the intelligence and reliability of our robotic solutions. This position is essential to our mission of achieving long-term general intelligence in robotic systems.\n\n\n## Key Responsibilities:\n• Lead the design and implementation of robotic software systems for control, sensing, and teleoperation\n• Develop software that interfaces with hardware SDKs for robot sensing and control and web APIs for data collection and remote operation\n• Develop tools for processing, visualizing, and verifying sensor data\n• Collaborate with the team to review and evaluate technical solutions\n• Lead the implementation of backend services and APIs to support complex AI and robotics systems\n• Collaborate with AI and hardware teams to manage software integration into hardware and research work streams\n• Participate in planning the product direction and developing roadmaps\n\n\n## Qualifications:\n• Bachelor’s degree or higher in Computer Science or a related field\n• 5+ years of professional experience in the software industry\n• Experience working with robotics or IoT device SDKs\n• Strong understanding of robotic control concepts including forward and inverse kinematics and 3D geometry\n• Ability to perform hands-on coding to implement complex software systems\n• Familiarity with coding best practices and design patterns\n• Proven track record of building highly reliable production software\n• Strong ownership, communication, and collaboration skills\n• Experience developing production software with Python\n\n\n## Preferred Qualifications:\n• Experience with robot control systems\n• Experience working with computer graphics or 3D data visualization\n• Proficiency in AI or robotics technologies\n• Experience with C, C++, and embedded systems\n• Experience with modern web apps, web services, and REST APIs\nCompensation Range: $180K - $270K",
    "description_hash": "4e300ca2726ad9e67bb360e757fa932152ff656dff5f419b7c3ae1585082d2ac"
  },
  {
    "id": "staff-electrical-engineer-redwood-city-ca",
    "title": "Staff Electrical Engineer",
    "location": "Redwood City, CA",
    "compensation": "$130K – $160K • Offers Equity",
    "description": "Company Overview:Dyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round.We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\nPosition Overview:As an Electrical Engineer at Dyna Robotics, you will focus on prototyping sensor and actuator designs in collaboration with researchers and customers. You will collaborate closely with both the AI research team and the China-based production hardware team to ensure seamless integration between AI models and the physical hardware platform. This role is crucial for achieving long-term general intelligence in robotic systems and is based on-site 5 days a week in Redwood City, California.\nKey Responsibilities:\n• Develop electronics for robotic systems related to low-level hardware.\n• Lead the development of embedded applications required for the robotic systems, including but not limited to PCBs, MCUs, sensors, ARM-based SoCs, cameras, and more.\n• Integrate experimental sensors and collaborate with researchers to improve robot performance.\n• Respond to issues at customer deployments and propose redesigns that improve reliability and performance.\nQualifications:\n• Bachelor’s degree or higher in Electrical Engineering, or other related field.\n• 3+ years of professional development experience in electronic hardware-related industries, such as robotics, smartphones, electric vehicles, drones, etc.\n• PCB design for custom sensors, LEDs, and power distribution.\n• Familiarity with common MCUs, including Arduino, ST, etc.\n• Experience in ARM-based SoC development, such as Raspberry Pi, Nvidia Jetson, etc.\n• Familiarity with communication protocols like CAN, USB, RS485, UART, etc.\n• Experience working with various sensors, including IMUs, cameras, LiDAR and other robotic system sensors.\n• Hands-on hardware debugging skills.\n• Comfort with hardware prototyping including soldering, using breadboards, and basic python scripting or C++ firmware development.\n• Strong ownership and collaboration skills.\n• Excellent communication skills.\nPreferred Qualifications:\n• Personal interest in robot learning\n• Familiarity with robotic control systems\n• Experience with robotics software (e.g. ROS)\nCompensation Range: $130K - $160K",
    "description_hash": "674f821b0799d9a1794b4ae9ee44aac1ea5ea5ddaac09cef1ee7be49367caacb"
  },
  {
    "id": "staff-full-stack-engineer-redwood-city-ca",
    "title": "Staff Full Stack Engineer",
    "location": "Redwood City, CA",
    "compensation": "$180K – $270K • Offers Equity",
    "description": "## Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round.We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\nLearn more at dyna.co\n\n\n## Position Overview:\nAs a full stack software engineer at Dyna Robotics, you will play a pivotal role in developing a wide range of software applications to support our cutting-edge robotic systems. You will lead design and development of web based applications for remote teleoperation systems, data collection and processing systems, metrics systems, and more. You will collaborate closely with our AI research and hardware teams to enhance the intelligence and reliability of our robotic solutions. This position is essential to our mission of achieving long-term general intelligence in robotic systems.\nKey Responsibilities:\n• Lead the UX and system design of web applications that support our robotic systems\n• Collaborate with the team to review and evaluate technical solutions\n• Lead the implementation of complex web-based AI and robotics tools\n• Work on full stack web applications including web frontend systems, REST API backends, and mobile web apps\n• Collaborate with AI and hardware teams to ensure software integration into hardware and research work-streams\n• Participate in planning the product direction and developing roadmaps\nQualifications:\n• Bachelor’s degree or higher in Computer Science or a related field\n• 7+ years of professional experience in the software industry, with a minimum of 2 years in a tech lead role\n• Ability to perform hands-on coding to implement complex software systems\n• Proficiency in modern web application technologies such as TypeScript, JavaScript, Python, ReactJS, NodeJS, web sockets, and REST APIs\n• Experience with full stack app development including databases and REST API backends\n• Experience with web technologies for 3D graphics and video streaming, such as Three.JS, WebGL, or WebRTC\n• Strong understanding of web UX design principles\n• Proven track record of building highly scalable applications\n• Experience deploying software using Docker, Kubernetes, and cloud platforms such as AWS or GCP\n• Strong ownership, communication, and collaboration skills\nPreferred Qualifications:\n• Proficiency in AI or robotics technologies\n• Strong leadership and people management skills\n• Experience with mobile app development\n\n\n## Benefits:\n• Competitive salary and equity in a seed-stage venture-backed startup\n• Comprehensive health, dental, and vision insurance\n• Daily catered lunches and dinner with a fully stocked kitchen\n• Professional growth and development through training, mentorship, and challenging projects\nCompensation Range: $180K - $270K",
    "description_hash": "1f5a0da0ceaca8f517a317cf1b4ab97b3cc85bf7c494923c8e1ff69d02ae68c6"
  },
  {
    "id": "staff-machine-learning-infrastructure-engineer-redwood-city-ca",
    "title": "Staff Machine Learning Infrastructure Engineer",
    "location": "Redwood City, CA",
    "compensation": "$180K – $270K • Offers Equity",
    "description": "## Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round.We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\nLearn more at dyna.co\n\n\n## Position Overview:\nWe  are seeking an experience Machine Learning Infrastructure Engineer to join our team and help scale our ML training platform. In this role, you will be responsible for designing, implementing, and maintaining large-scale ML infrastructure to accelerate model iteration and improve training performance across an expanding GPU ecosystem. You will work on cutting-edge high-performance computing systems, optimizing distributed training environments, and ensuring system reliability as we scale. \n\n\n## Key Responsibilities:\n• Infrastructure Design & Scalability:Architect and implement large-scale ML training pipelines that leverage parallel GPU processing on platforms like GCP or AWS.Enhance our existing infrastructure to fully exploit parallelism and design for future expansion, ensuring that our system is ready to support growth.\n• High-Performance ML Computing & Distributed Systems:Manage and optimize high-performance computing resources.Develop robust distributed computing solutions, addressing challenges like race conditions, memory optimization, and resource allocation.Optimize model training with techniques like mixed precision, ZeRO, Lora, etc.\n• Job Scheduling & Reliability:Design systems for job rescheduling, automated retries, and failure recovery to maximize uptime and training efficiency.Implement intelligent job queuing mechanisms to optimize training workloads and resource utilization.\n• Storage & Data Handling:Evaluate and implement tradeoffs between different local and networked storage solutions to improve data throughput and access.Develop strategies for caching training data to optimize performance.\n• Collaboration & Continuous Improvement:Work closely with ML researchers and data scientists to understand training requirements and bottlenecks.Continuously monitor system performance, identify areas for improvement, and implement best practices to enhance scalability and reliability.\n\n\n## Required Qualifications:\n• Bachelor’s degree or higher in Computer Science or a related field.\n• At least 7 years of professional experience in the software industry, with a minimum of 2 years in a tech lead role.\n• Proven experience with high-performance computing environments and distributed systems.\n• Demonstrated ability to scale ML training systems and optimize resource utilization.\n• Hands-on experience with job scheduling systems and managing cloud GPU environments (GCP, AWS, etc.).\n• Deep understanding of distributed computing concepts, including race conditions, memory optimization, and parallel processing.\n• Hands-on experience in ML model tuning for performance.\n• Experience with common ML training and inference tools including PyTorch, TensorRT, Triton, Accelerate, etc.\n• Strong analytical and problem-solving skills with the ability to troubleshoot complex system issues.\n• Excellent communication skills to collaborate effectively with cross-functional teams.\n\n\n## Preferred Qualifications:\n• Experience with container orchestration tools (e.g., Kubernetes) and infrastructure-as-code frameworks.\nIf you're passionate about building scalable ML systems and optimizing high-performance computing infrastructures, we'd love to hear from you.\nCompensation Range: $180K - $270K",
    "description_hash": "20a178222925d0cdc95f20fb470882b26072d49fdafc1cd8dcc5c548916d0364"
  },
  {
    "id": "state-estimation-engineer-redwood-city-ca",
    "title": "State Estimation Engineer",
    "location": "Redwood City, CA",
    "compensation": "$200K – $270K • Offers Equity",
    "description": "## Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round. We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\nLearn more at dyna.co\n\n\n## Position Overview:\nAs our first dedicated State Estimation Engineer, you will own the estimation systems that enable our robots and data collection tools to perceive their state in dynamic, unstructured environments. You will build sensor fusion pipelines, calibration tools, and diagnostics infrastructure—leveraging classical techniques while exploring learning-based approaches to push the boundaries of what's possible. This is a foundational role with significant ownership and direct impact on developing the most robust robotics foundation model.\n\n\n## Key Responsibilities:\n• Build core estimation systemsDesign and implement state estimation algorithms (EKF, UKF, factor graphs, optimization-based methods) for localization, pose tracking, and contact estimationDevelop sensor fusion pipelines integrating IMUs, encoders, force/torque sensors, cameras, and LiDAROwn visual state estimation (VIO, visual SLAM) and LiDAR-based localization\n• Own the full stack from prototype to productionBuild calibration systems, diagnostics tools, and validation benchmarksOwn estimation for both production robots and data collection tools\n• Push the boundariesDecide when to ship a robust classical solution now versus invest in a learned approachExperiment with learning-based estimation (learned dynamics, neural filtering) to complement classical methodsCollaborate with AI and hardware teams on sensor selection and integration\n\n\n## Qualifications:\n• 5+ years building state estimation systems on physical robots (not just simulation)\n• Deep expertise in sensor fusion, visual or LiDAR-based localization, and filtering/optimization methods\n• Strong foundation in probability, linear algebra, optimization, and 3D geometry\n• Proficiency in C++ for real-time systems; Python for tooling\n• Track record of taking an estimation system from prototype to production deployment\n\n\n## Preferred Qualifications:\n• MS or PhD with research focus on state estimation, SLAM, VIO, or sensor fusion\n• Experience with manipulation or high-DOF robotic systems\n• Hands-on experience with learning-based estimation or differentiable filtering\n• Contributions to open-source robotics or publications (ICRA, IROS, RSS)\nCompensation Range: $200K - $270K",
    "description_hash": "bc1feb343b427f9ee37f92e2d8e02e319aaa9913935a3c43f27ceb990fd0fc9a"
  },
  {
    "id": "technical-support-engineer-redwood-city-ca",
    "title": "Technical Support Engineer",
    "location": "Redwood City, CA",
    "compensation": "$100K – $130K • Offers Equity",
    "description": "## Company Overview:\nDyna Robotics is at the cutting edge of robotic manipulation technology, driving the industry forward with state-of-the-art foundation models. Our mission is to automate repetitive and fixed tasks with affordable, intelligent robotic arms, helping businesses increase efficiency. By leveraging the latest advancements in foundation models, we aim to advance general-purpose robotics with a focus on enhancing manipulation skills.\nDyna Robotics was founded by industry veterans who previously achieved a $350 million exit in the deep-tech grocery sector. Our team comprises top robotics researchers from DeepMind and Nvidia, merging world-class research, engineering, and product innovation to drive the future of robotic manipulation. The company has raised over $140M, backed by top investors, including CRV and First Round.We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\n\n\n## Position Overview:\nWe are seeking a hands-on IT & Hardware Support Engineer to maintain and support our technical infrastructure, ensuring smooth operations for our team. This role combines IT support, networking, Linux system administration, and hardware installation. It's perfect for someone who enjoys troubleshooting software issues and working with physical hardware. If you thrive in a dynamic environment and love solving technical challenges, we want to hear from you!\n\n\n## Key Responsibilities:\nIT & Network Support\n• Set up and maintain office IT infrastructure, including WiFi, network switches, routers, and DNS configurations.\n• Troubleshoot network issues, connectivity problems, and performance bottlenecks for the team.\n• Manage VPN access and device security configurations.\nMachine & Operator Support\n• Set up new Linux-based machines for operators, including initializing hardware, running setup scripts, and configuring VPN access.\n• Provide hands-on support for technical issues such as disconnected devices, network failures, and disk space management.\n• Assist with system updates, patches, and troubleshooting software failures.\nMonitoring & Incident Response\n• Proactively monitor device health and system performance using tools like Tailscale VPN, Datadog, and other monitoring dashboards.\n• Identify and address hardware and software failures before they impact operations.\n• Respond quickly to support requests raised via Slack or other communication channels.\nHardware Installation & Maintenance\n• Install, replace, and troubleshoot hardware at robot stations, including cameras, sensors, and other connected devices.\n• Replace broken parts and faulty hardware in the field.\n• Work closely with the engineering team to ensure hardware installations are correctly configured and operational.\nProcurement & Documentation\n• Order and manage IT equipment, robot station components, and replacement hardware.\n• Maintain documentation of setup procedures, common issues, and troubleshooting guides to support operators.\n• Share knowledge and best practices to improve support workflows.\n\n\n## Qualifications\n• Experience with Linux system administration and command-line tools.\n• Knowledge of networking fundamentals (WiFi, VPNs, DNS, basic router/switch configurations).\n• Hands-on experience troubleshooting IT and hardware-related issues.\n• Familiarity with remote monitoring tools like Tailscale VPN, Datadog, or similar.\n• Ability to install and maintain hardware, including cameras, sensors, and other robotic components.\n• Strong communication skills for documenting and sharing knowledge.\n• A proactive, problem-solving mindset with the ability to diagnose and resolve issues independently.\n\n\n## Nice to Have\n• Experience with automation tools (e.g., Ansible, Bash scripting) to streamline IT tasks.\n• Previous experience in robotics, hardware integration, or technical field support.\n• Basic familiarity with cloud services and remote device management.\n\n\n## What We Offer:\nCompetitive salary, comprehensive benefits, and the opportunity to work alongside world-class experts shaping the future of AI and robotics.\nCompensation Range: $100K - $130K",
    "description_hash": "862f985e6ea74ef3c4c99484f61d5872ba1eb1fcfd56fb3ea859fcbb163b3cb0"
  },
  {
    "id": "biz-ops-programs-manager-redwood-city-ca",
    "title": "Biz Ops Programs Manager",
    "location": "Redwood City, CA",
    "compensation": "$150K – $200K • Offers Equity",
    "description": "## Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round.We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\n\n\n## Position Overview:\nAt Dyna Robotics, we are building automation solutions that transform high-volume, repetitive tasks into reliable robotic workflows. As we scale deployments, customer operations, and internal processes, we are looking for a Business Operations Programs Manager to help translate high-level company priorities into clear, actionable work.\nThis role focuses on execution, structure, and operational rigor. You will take direction from leadership, turn it into detailed plans, and ensure that projects are completed end-to-end. You’ll help build processes, implement tools, coordinate across teams, and step into workflows hands-on when needed. The ideal candidate is organized, resourceful, and loves bringing order to a fast-moving startup environment.\n\n\n## Key Responsibilities:\nDrive Cross-Functional Operational Projects\n• Own operational programs from scoping through execution, ensuring teams stay aligned and unblocked.\n• Execute on leadership priorities by breaking down ambiguous goals into clear tasks, timelines, and responsibilities.\n• Coordinate across Engineering, Product, Operations, Deployment, and Customer teams to ensure progress and accountability.\n• Manage ad hoc projects that arise as the company scales—anything from vendor coordination to customer onboarding workflows to launch readiness.\nBuild & Improve Processes\n• Design, document, and maintain repeatable workflows for internal operations and deployments.\n• Establish templates, SOPs, and operational checklists that bring structure and consistency across the org.\n• Identify inefficiencies and propose improvements that increase speed, reliability, and clarity.\nHands-On Execution & Reporting\n• Step directly into workflows when needed—updating trackers, completing tasks, preparing reports, and ensuring things move forward without bottlenecks.\n• Build dashboards and simple reporting structures to give leadership visibility into progress and performance.\n• Maintain operational systems until they can be automated or delegated.\nImplement Tools & Automation\n• Set up and manage tools the org relies on (Notion, Airtable, Slack workflows, GSheets, Zapier, etc.).\n• Create lightweight automation to reduce manual work and improve information flow.\n• Ensure teams use tools consistently and workflows remain organized and maintained.\n\n\n## Qualifications:\n• 3–7 years in business operations, program management, or a similar execution-focused role within a startup or fast-paced environment.\n• Strong project management and organizational skills; you can take a high-level plan and run with it independently.\n• Experience building and maintaining processes, documentation, and operational workflows.\n• Comfortable with operational tools (Airtable, Notion, Zapier, Slack automations, dashboards).\n• Willing to do hands-on operational work and step into the details to keep things moving\nCompensation Range: $150K - $200K",
    "description_hash": "b945be90c4aa2a027383aa5e3c67a306f3f942ec6667487f0b01fcc71c252fc2"
  },
  {
    "id": "data-annotation-specialist-redwood-city-ca",
    "title": "Data Annotation Specialist",
    "location": "Redwood City, CA",
    "compensation": "$32 per hour",
    "description": "Company Overview:\nDyna Robotics is at the forefront of revolutionizing robotic manipulation with cutting-edge foundation models. Our mission is to empower businesses by automating repetitive, stationary tasks with affordable, intelligent robotic arms. Leveraging the latest advancements in foundation models, we're driving the future of general-purpose robotics—one manipulation skill at a time.\nDyna Robotics was founded by industry leaders who previously achieved a $350 million exit in grocery deep tech as well as top robotics researchers from DeepMind and Nvidia. Our team blends world-class research, engineering, and product innovation to drive the future of robotic manipulation. With $20mil+ in funding, we're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics.\nPosition Overview:\nAs a Data Annotation Specialist at Dyna Robotics, you will be pivotal in iterating on our AI system by annotating data on various diverse tasks performed by robots. Your will directly influence the performance of our robotic arms, helping them become more accurate and efficient. You will work closely with our engineering and research teams, ensuring data is labeled of the highest quality and meets required standards.\nKey Responsibilities:\n• Manually annotate video sequences (boxes/masks/keypoints), track IDs, and label actions & temporal segments\n• Maintain data integrity by applying guidelines and QC checks; resolve ambiguities and fix errors\n• Leverage pre-annotation/autolabeling tools to boost throughput—validate/correct model prelabels and tune auto-tracking/segmentation pipelines\nQualifications:\n• Associate’s or Bachelor’s degree (or equivalent experience)\n• Strong attention to detail; consistent application of guidelines\n• Ability to follow detailed instructions and work independently with minimal supervision\n• Clear written communication and a collaborative attitude\nPreferred Qualifications:\n• Hands-on experience annotating video (boxes/masks/keypoints, action labels, ID tracking)\n• Proficiency with annotation tools; comfort with pre-annotation/autolabel review and correction\n• Familiarity with QA practices (inter-annotator agreement, spot checks, golden sets)\n• Knowledge of common annotation formats (e.g., COCO, YOLO, MOT/KITTI) and basic video concepts (frame rate, codecs)",
    "description_hash": "4fd9d9d66f4ade850711d20e6ad282c2940de377af6f4d1c36186f3c3c35ad3e"
  },
  {
    "id": "data-collection-operator-redwood-city-ca",
    "title": "Data Collection Operator",
    "location": "Redwood City, CA",
    "compensation": "Pay Rate $30 – $32 per hour",
    "description": "Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry. Dyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round.We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!Position Overview:As a Data Collector at Dyna Robotics, you will be pivotal in iterating on our AI system by producing high quality, robust data of various diverse tasks. You will directly influence the performance of our robotic arms, helping them become more accurate and efficient. You will work closely with our engineering and research teams, ensuring data collected is of the highest quality and meets required task standards.This role is primarily on-site at our Redwood City, CA headquarters. We maintain a high bar for talent and look for individuals who thrive in fast-paced, hands-on environments. Outstanding performers may be considered for conversion to a full-time (FTE) position based on performance and team needs.Key Responsibilities:\n• Manually control robot arms to perform a diverse range of tasks (Teleoperation)\n• Maintain data integrity by ensuring recorded data is annotated correctly\n• Produce detailed reports of robot performance for data analysis and task iteration\nQualifications:\n• Associates or Bachelor College degree or equivalent\n• Strong attention to detail and manual dexterity.\n• Ability to stand and move for long periods of time.\n• Ability to follow detailed instructions and work independently with minimal supervision.\n• Good communication skills and a collaborative attitude.\nPreferred Qualifications:\n• Experience with robotic systems, teleoperation, or related fields.\n• Experience with data annotation tools and methodologies.\n• Familiarity with safety protocols in a lab or industrial setting.\n• Basic working knowledge and familiarity with computer software interfaces and tools (e.g., the command line, bash, linux OS)",
    "description_hash": "ac05255b2b095338ce2512b1f830308fc363ddebe170a695252900661528664d"
  },
  {
    "id": "founding-head-of-sales-redwood-city-ca",
    "title": "Founding Head of Sales",
    "location": "Redwood City, CA",
    "compensation": "",
    "description": "## Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round. We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\nLearn more at dyna.co\n\n\n## Position Overview:\nWe are seeking an experienced Founding Head of Sales to lead our commercial efforts. This is a high-impact \"Player-Coach\" role for a strategic hunter who thrives in a fast-paced environment. You will be responsible for defining our Go-to-Market strategy, personally closing marquee Enterprise deals, and laying the groundwork for a scalable sales organization.\nYou will act as a key partner to the CEO and Engineering team, ensuring that our commercial roadmap aligns with market realities and technical capabilities.\nKey Responsibilities:\n• Lead From the Front: Operate as a true \"player-coach,\" dedicating 80% of your time to hands-on sales and leading from the front. You will simultaneously manage and mentor a specialized team of representatives for high-velocity accounts, establishing the performance standards and culture that will define the future of our sales organization.\n• Drive Enterprise Growth: Personally own the full sales cycle for Tier-1 Enterprise accounts—from prospecting and relationship building to contract negotiation and closing.\n• Strategy & GTM Architecture: Develop and evolve our business development strategy across different growth phases. You will define who we target, how we price, and how we position the Dyna brand in the market.\n• Cross-Functional Collaboration: Partner closely with Engineering and Product to translate customer requirements into feasible technical solutions. You will act as the bridge between client needs and our product roadmap.\n• Market Feedback Loop: Serve as the \"voice of the customer.\" You will gather and synthesize market feedback to influence branding, marketing messaging, and product features, ensuring we achieve strong product-market fit.\nWho You Are:\n• A Proven Hunter: You have a track record of closing complex, six-figure+ deals with large Enterprise organizations. You know how to navigate procurement, legal, and multiple stakeholders to get deals across the line.\n• Tech-Fluent: You are comfortable selling complex hardware or deep-tech solutions. You can learn technical concepts quickly and communicate them clearly to non-technical stakeholders without over-promising.\n• Strategic & Adaptable: You can switch gears between high-level strategy (positioning, market mapping) and tactical execution (cold calling, demoing). You understand how to tailor your approach for early-adopter \"visionary\" clients versus traditional buyers.\n• Autonomous Operator: You have high agency and can drive results with minimal oversight. You are comfortable building processes from scratch, from CRM setup to sales playbooks.\nQualifications:\n• 7+ years of B2B sales experience, with significant exposure to Enterprise Sales.\n• Proven track record closing $500K+ deals (or similar scale) with multi-stakeholder buying committees.\n• Experience selling into Ops-heavy environments (logistics, retail ops, warehousing, manufacturing, hospitality)\n• Experience closing and structuring pilots that convert to rollouts, with clear success metrics, timeline, and expansion path.\n• Experience in Robotics, Hardware, Logistics, or Deep Tech is highly preferred but not required.\n• Willing to get very hands on, and demonstrated ability to lead a sales function or small team in a startup environment.\n• Strong negotiation skills and financial acumen (understanding of CAPEX/OPEX models).",
    "description_hash": "bdb58344785518189bf7d580547b28233f181aaecba5a42429cd75bca962c123"
  },
  {
    "id": "marketing-manager-redwood-city-ca",
    "title": "Marketing Manager",
    "location": "Redwood City, CA",
    "compensation": "$170K – $220K • Offers Equity",
    "description": "Company Overview\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\n Dyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors including CRV and First Round. We’re positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics.\nLearn more at dyna.co\nPosition Overview\nWe are hiring our first-ever marketer.\nThis is not a traditional marketing role. You will not be managing an agency to run ads. You will be the strategic partner to the founders and the \"Chief Narrator\" of Dyna. You will work side-by-side with our leadership team to build the entire marketing engine from scratch—from crafting the pitch that lands a Fortune 500 partnership to attracting the world’s top talents to defining the company branding.\nWe are looking for a \"full-stack\" marketer who is technical enough to understand our foundation models and commercial enough to close deals. You will translate the complexity of embodied AGI into a clear, inevitable truth for our customers, partners, and talents.\nIn This Role, You Will\n• Own the Narrative: You will take our technical breakthroughs and distill them into a compelling story. You will write the words that define who we are—on the website, in events, and in the press.\n• Drive Commercial GTM: Dyna is driven to make real value. You will partner with our founders and deployment teams to build the marketing materials that win customers. This includes creating high-leverage sales collateral and case studies that resonate with customers across industries.\n• Launch Products: You will own the \"moment.\" When we release a new model capability or a new robot form factor, you will orchestrate the launch, coordinating PR, social, video, and developer comms to maximize impact.\n• Win the talents: You will work with our Chief Scientist to understand the top talents we want to achieve and with the partnership team to figure creative ways to discovery and attract the best and the most potential talents in the field.\n• Build the Growth Engine: You will experiment with and define our early channels for lead generation. Whether it’s organizing an exclusive demo day for industry execs or building a content engine that attracts top roboticists, you will find what works and scale it.\nYou Might Thrive In This Role If You\n• Have 3-6+ years of experience in high-growth product marketing or growth marketing, ideally at a deep tech, autonomous driving, or AI application company.\n• If you are just AMAZING, ignore the first point - but tell us why you are special.\n• Are a world-class writer. You don't just write \"copy\"; you write arguments. You can explain why a transformer-based policy is better than classical control theory without using jargon that alienates business buyers.\n• Are a \"0-to-1\" builder. You have likely been the first or second marketer at a company before. You are comfortable working with no playbook, no existing assets, and high expectations.\n• Are technical-curious. You don't need to be an engineer, but you should be fascinated by AI. You are the kind of person who reads the \"Technical Report\" of a new model release, not just the press release.\n• Have a bias for action. We move at the speed of our robots (which is fast). You are comfortable shipping a landing page on Tuesday and flying to a customer site on Thursday to film a testimonial.\nBonus Points\n• Design experience; unique insights in building a brand\n• Experience managing PR or external communications during high-stakes launches.\nWhy Join Now?\nThere are very few times in history when a new category of technology emerges. Personal computing in the 80s, the Internet in the 90s, Generative AI in the 2020s. Embodied AI is next. This is your chance to own the story of the company that brings it to the real world.\nCompensation Range: $170K - $220K",
    "description_hash": "9f01915c28dc686359c5fa2dc2faef4c7477a4b286e22c5a736c7b1febce585d"
  },
  {
    "id": "controls-research-engineer-redwood-city-ca",
    "title": "Controls Research Engineer",
    "location": "Redwood City, CA",
    "compensation": "$180K – $290K • Offers Equity",
    "description": "## Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round. We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\nLearn more at dyna.co\n\n\n## Position Overview:\nAs a controls researcher at Dyna Robotics, you will be responsible for ensuring that our robots take full advantage of their actuators. You will lead design, testing, and implementation of control algorithms that leverage all available information to allow the most dynamic motion possible. You will also develop tools to make controls research easier, and allow larger parts of the team to understand the impact of control on the overall performance of the robot. You will collaborate closely with robotics engineers, AI researchers, and hardware engineers to ensure optimal performance of our overall system.\nKey Responsibilities:\n• Design, implement, and tune control algorithms for semi-humanoid robots, with emphasis on learning-based approaches (RL, imitation learning, adaptive control)\n• Build high-fidelity simulations and benchmarks to rapidly iterate on controller and policy performance\n• Analyze actuator dynamics and sensor data to get the most out of our motors\n• Create internal tools that help the broader team visualize and understand control behavior\n• Collaborate with hardware engineers on actuator selection, sensor integration, and mechanical design trade-offs\n• Work with AI/ML researchers to connect learned behaviors to low-level motor control\n• Document methods so insights scale across the organization\nQualifications:\n• MS or PhD in robotics, controls, machine learning, or a related field\n• Experience with learning-based control (e.g. reinforcement learning, imitation learning)\n• Strong foundation in classical control (PID, LQR, MPC) and state estimation\n• Proficiency in C++ and Python; experience with real-time systems\n• Experience deploying controllers or learned policies on physical hardware\n• Familiarity with simulation tools (MuJoCo, Isaac Sim, Drake, or similar)\n• Strong communication skills and ability to work across teams\nPreferred Qualifications:\n• Deep interest in pushing dynamic performance—faster movements, higher bandwidth, better stability margins\n• Track record of publications in robot learning, robotic manipulation, or humanoid control\n• Experience with low-level motor drivers\n• Prior work at a robotics startup\nCompensation Range: $180K - $290K",
    "description_hash": "790ca21ccb55e22ce9b779f22d7fb145713a796754f108e0ea8bb13e753a79a1"
  },
  {
    "id": "research-engineer-scientist-redwood-city-ca",
    "title": "Research Engineer/ Scientist",
    "location": "Redwood City, CA",
    "compensation": "$180K – $300K • Offers Equity",
    "description": "## Company Overview:\nDyna Robotics makes general-purpose robots powered by a proprietary embodied AI foundation model that generalizes and self-improves across varied environments with commercial-grade performance. Dyna's robots have been deployed at customers across multiple industries. Its frontier model has the top generalization and performance in the industry.\nDyna Robotics was founded by repeat founders Lindon Gao and York Yang, who sold Caper AI for $350 million, and former DeepMind research scientist Jason Ma. The company has raised over $140M, backed by top investors, including CRV and First Round. We're positioned to redefine the landscape of robotic automation. Join us to shape the next frontier of AI-driven robotics!\nLearn more at dyna.co\n\n\n## Position Overview\nWe are seeking a Research Engineer / Scientist to join our team and help us build and deploy cutting-edge AI models that work reliably in the real world. This role is a hybrid of research and engineering, requiring you to be both a skilled model trainer and a meticulous debugger. You will be responsible for the full lifecycle of production research pipelines—from training advanced models to analyzing their behavior and driving continuous improvements.\nYour work will be crucial for both our short-term deliverables and long-term competitive advantage. You will translate ambiguous, real-world challenges into clear, solvable research and engineering problems, and your research will focus on developing new AI models and algorithms for dexterous robotic manipulation. You will collaborate closely with cross-functional teams to rapidly iterate on novel algorithms and large-scale model training to deliver general and adaptive robotic manipulation models.\n\n\n## Key Responsibilities\n• Research, develop, and fine-tune large deep learning models, including vision-language models (VLMs) and other AI models for robotic manipulation tasks.\n• Design, implement, and evaluate new robot learning algorithms, such as reinforcement learning and imitation learning, on both physical robots and simulation platforms.\n• Analyze training results, debug model failures, identify performance bottlenecks, and resolve subtle implementation issues to improve overall system performance.\n• Run structured experiments and ablations to isolate root causes and inform iterative improvements.\n• Collaborate with data and robotics teams to refine data collection, labeling, and filtering strategies.\n• Build tools and dashboards for tracking metrics, visualizing model performance, and surfacing anomalies.\n• Translate practical product needs or robot behaviors into well-scoped research or engineering problems.\n• Produce and deliver dependable, high-quality robotic software solutions.\n\n\n## Qualifications\n• Minimum of 5 years of experience in applied machine learning, deep learning, or AI and robotics research.\n• Master's degree or above in Computer Science, Robotics, or a related discipline, or comparable hands-on experience.\n• Comprehensive understanding of machine learning and deep learning fundamentals, especially with Transformer architectures, representation learning, and robot learning methodologies (e.g., reinforcement learning, imitation learning).\n• Practical experience in debugging, optimizing, and improving deep learning models in production or research settings.\n• Proficiency in Python and at least one major deep learning framework like PyTorch, TensorFlow, or JAX.\n• Familiarity with robot simulation platforms such as Mujoco, NVIDIA Isaac Stack, or Drake, and experience deploying AI models on physical robots.\n• Comfortable with data analysis tools and workflows (e.g., NumPy, Pandas).\n• Demonstrated ability to turn ambiguous real-world issues into actionable research/engineering projects.\n• Superior analytical and problem-solving abilities with a methodical, detail-oriented approach to experimentation.\n• Strong enthusiasm for robotics and developing robotic products.\n• Understands how to write scalable, modular, and maintainable research code in collaborative environments.\n\n\n## Preferred Qualifications\n• PhD in Computer Science, Electrical Engineering, Robotics, or a related discipline.\n• Experience with robotics systems (ROS) or production inference/debugging infrastructure.\n• Familiarity with multi-modal foundation models.\n• Demonstrated research excellence, evidenced by publications in prestigious conferences such as NeurIPS, ICML, ICLR, CVPR, RSS, CoRL, or ICRA.\n• Exceptional creativity, productivity, and independent research skills.\nCompensation Range: $180K - $300K",
    "description_hash": "fe34d5077bc89b875408f3f8dd44bef83a9cc12abeda8328268ef5027d8bb13e"
  }
]